EDTconf/src/InformationRegisters/ИсполнителиЗадач/ИсполнителиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсполнителиЗадач</name>
  <attributes>
    <name>ГруппаИсполнителейЗадач</name>
    <type>
      <types>CatalogRef.ГруппыИсполнителейЗадач</types>
    </type>
  </attributes>
  <dimensions>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDTconf/src/Enums/ТипыТекстовПочтовыхСообщений/ТипыТекстовПочтовыхСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТекстовПочтовыхСообщений</name>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>ПростойТекст</name>
  </enumValues>
  <enumValues>
    <name>РазмеченныйТекст</name>
  </enumValues>
</mdclass:Enum>

EDTconf/src/Documents/ИсходящееПисьмо/ИсходящееПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИсходящееПисьмо</name>
  <basedOn>Catalog.ПроектныеЗадачи</basedOn>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <basedOn>Catalog.Файлы</basedOn>
  <basedOn>Document.Заявка</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВажностьПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительКонтакт</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ЛичныеАдресаты</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодготовленоКОтправке</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучателиКопийСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучателиПисьмаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучателиСкрытыхКопийСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DocumentRef.Заявка</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИзвлеченныйТекст</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтправительАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтправительОтображаемоеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовПочтовыхСообщений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкрытыхКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDTconf/src/CommonModules/РассылкаОтчетов/Module.bsl
Процедура РассылкаОтчетовПоЗаявкам() Экспорт
	// Получатель отчета
	ПолучателиОтчета = ПолучитьПолучателейОтчетаПоЗаявкам();
	Если ПолучателиОтчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	тзВложения = Новый ТаблицаЗначений;
	тзВложения.Колонки.Добавить("Вложение");
	тзВложения.Колонки.Добавить("ИмяФайлаВложения");
	тзВложения.Колонки.Добавить("ИмяВложения");
	
	Отчет = Отчеты.ОтчетПоЗаявкам.Создать();
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	Результат = Новый ТабличныйДокумент;
	

    Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчет.СхемаКомпоновкиДанных.ВариантыНастроек["ЗаявкиВРаботе"].Настройки);	
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(Отчет.СхемаКомпоновкиДанных, Отчет.КомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ИмяФайлаОтчета = КаталогВременныхФайлов() + "ОтчетПоЗаявкам.xls";
	
	Результат.Записать(ИмяФайлаОтчета,ТипФайлаТабличногоДокумента.XLS97);
	
	ФайлОтчета = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ИмяФайлаОтчета), Новый СжатиеДанных());
	
	НоваяСтр = тзВложения.Добавить();
	НоваяСтр.ИмяВложения = "ОтчетПоЗаявкам.xls";
	НоваяСтр.Вложение = ФайлОтчета;
	НоваяСтр.ИмяФайлаВложения = ИмяФайлаОтчета;
	СформироватьПисьмо(тзВложения, ПолучателиОтчета);
КонецПроцедуры

Функция СформироватьПисьмо(тзВложения, ПолучателиОтчета)
	ПисьмоОбъект = Документы.ИсходящееПисьмо.СоздатьДокумент();
	
	СтруктураРеквизитов = ПисьмоОбъект.СформироватьСтруктуруРеквизитовПисьма(Неопределено);
	
	ЗаполнитьЗначенияСвойств(ПисьмоОбъект, СтруктураРеквизитов);
	
	ТекстПисьма = "Запланированные заявки и заявки в работе";
 
	Для Каждого Получатель Из ПолучателиОтчета Цикл
		АдресРаспределителя = РаботаСЗаявкамиИПочтой.ПолучитьАдресПользователя(Получатель);
		Если ЗначениеЗаполнено(АдресРаспределителя) Тогда
			НоваяСтр = ПисьмоОбъект.ПолучателиКопий.Добавить();
			НоваяСтр.Адрес = АдресРаспределителя;
			НоваяСтр.Контакт = Получатель;
			НоваяСтр.ОтображаемоеИмя = Получатель.Наименование;
		КонецЕсли;
	КонецЦикла;
	
	КодировкаИсходящихПисем = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"ВстроеннаяПочта",
		"КодировкаИсходящихПисем",
		"utf-8");
	ПисьмоОбъект.Кодировка = КодировкаИсходящихПисем;
	
	ПисьмоОбъект.ТекстХранилище			= Новый ХранилищеЗначения(ТекстПисьма, Новый СжатиеДанных);
	ПисьмоОбъект.ПодготовленоКОтправке	= ТекущаяДатаСеанса();
	
	// тема и текст оповещения 
	ПисьмоОбъект.Тема = "Отчет по завкам";
	
	ПисьмоОбъект.ТипТекста = Перечисления.ТипыТекстовПочтовыхСообщений.ПростойТекст;
	
	ПисьмоОбъект.Записать();
	
	Для Каждого СтрокаТЗ Из тзВложения Цикл
		Адрес = ПоместитьВоВременноеХранилище(СтрокаТЗ.Вложение.Получить(), Новый УникальныйИдентификатор() );
		ВстроеннаяПочтаСервер.ДобавитьВложениеПисьмаИзВременногоХранилища(
								ПисьмоОбъект.Ссылка, // Письмо
								Адрес, // АдресВременногоХранилища
								"", // АдресВременногоХранилищаТекста
								0,
								СтрокаТЗ.ИмяВложения,
								ТекущаяДата(), // ВремяИзменения
								Неопределено); // Идентификатор - идентификатор картинки
	КонецЦикла;
	
	//ПисьмоРазмер = СтрДлина(ПисьмоТекстHTML);
	//ПисьмоРазмерПредставление = РаботаСоСтроками.ПолучитьРазмерСтрокой(ПисьмоРазмер);
	//ИмяВременногоФайла = ПолучитьИмяВременногоФайла("html");
	//ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, ЗаявкаСсылка.ДокументОснование.Кодировка);
	//ЗаписьТекста.Записать(ПисьмоТекстHTML);
	//ЗаписьТекста.Закрыть();
	//Данные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	//Адрес = ПоместитьВоВременноеХранилище(Данные, Новый УникальныйИдентификатор() );
	//ВстроеннаяПочтаСервер.ДобавитьВложениеПисьмаИзВременногоХранилища(
	//						ПисьмоОбъект.Ссылка, // Письмо
	//						Адрес, // АдресВременногоХранилища
	//						"", // АдресВременногоХранилищаТекста
	//						ПисьмоРазмер,
	//						"Original.html",
	//						ТекущаяДата(), // ВремяИзменения
	//						Неопределено); // Идентификатор - идентификатор картинки
	
	
	
	Возврат ПисьмоОбъект.Ссылка;
КонецФункции // ()

Функция ПолучитьПолучателейОтчетаПоЗаявкам() Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсполнителиЗадач.Исполнитель
		|ИЗ
		|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
		|ГДЕ
		|	ИсполнителиЗадач.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ПолучательОтчетаПоЗаявкам)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсполнителиЗадач.Исполнитель";
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Исполнитель");	
КонецФункции // ПолучитьПолучателейОтчетаПоЗаявкам()
